#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/whip-up/csharp-clean-architecture-github-action/runs/run-4ASFbNLXgPFpPLLh

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_cloudwatch_log_group.task: Refreshing state... [id=clean-slice-production]
aws_ecr_repository.dot-net-architecture: Refreshing state... [id=clean-slice]
data.aws_vpc.this: Refreshing...
aws_iam_role.task: Refreshing state... [id=terraform-20230427135024309700000002]
data.aws_region.current: Refreshing...
aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:cluster/clean-slice-cluster]
data.aws_caller_identity.current: Refreshing...
data.aws_region.current: Refresh complete after 0s [id=ap-southeast-2]
data.aws_caller_identity.current: Refresh complete after 1s [id=467945566648]
aws_iam_role_policy_attachment.task[0]: Refreshing state... [id=terraform-20230427135024309700000002-20230427135025049600000005]
aws_iam_role_policy.task: Refreshing state... [id=terraform-20230427135024309700000002:terraform-20230427135024933600000004]
aws_ecs_task_definition.initiator: Refreshing state... [id=clean-slice-task]
data.aws_vpc.this: Refresh complete after 2s [id=vpc-d23709b5]
data.aws_subnets.this: Refreshing...
aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:targetgroup/clean-slice-lb-tg/a08d81c514673f11]
aws_security_group.this: Refreshing state... [id=sg-0e1ef5e8e637d4a4f]
data.aws_subnets.this: Refresh complete after 1s [id=ap-southeast-2]
aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:loadbalancer/app/clean-slice-alb/0d8a0f9701063a6c]
aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:listener/app/clean-slice-alb/0d8a0f9701063a6c/c9d5eeafad5c649b]
aws_lb_listener_rule.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:467945566648:listener-rule/app/clean-slice-alb/0d8a0f9701063a6c/c9d5eeafad5c649b/5a284721b4302296]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-southeast-2:467945566648:service/clean-slice-cluster/clean-slice]
aws_ecs_task_definition.initiator: Drift detected (update)
aws_iam_role.task: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.initiator must be replaced
-/+ resource "aws_ecs_task_definition" "initiator" {
      ~ arn                      = "arn:aws:ecs:ap-southeast-2:467945566648:task-definition/clean-slice-task:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ command          = [
                      - "/bin/sh -c \"echo '<html> <head> <title>Clean slice</title> <style>body {margin-top: 40px; background-color: #333;} </style> </head><body> <div style=color:white;text-align:center> <h2>Congratulations!</h2> <p>Time to deploy your app!</p> </div></body></html>' >  /usr/local/apache2/htdocs/index.html && httpd-foreground\"",
                      + "/bin/sh -c \"echo '<html> <head> <title>Temporary page</title> <style>body {margin-top: 40px; background-color: #333;} </style> </head><body> <div style=color:white;text-align:center> <h2>Congratulations!</h2> <p>Now ready for CICD.</p> </div></body></html>' >  /usr/local/apache2/htdocs/index.html && httpd-foreground\"",
                    ]
                  - cpu              = 0
                  - environment      = []
                  - mountPoints      = []
                    name             = "clean-slice"
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "clean-slice-task" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @jonyeezs*